  <h1>⚪ Preparation</h1>

  <style>
    h1 {
      color:darkblue;
      text-align: center;
      vertical-align: middle;
      border-radius: 67px;
      border: 1px solid #fff;
      background: linear-gradient(
        180deg,
        #d9d9d9 82.92%,
        rgba(217, 217, 217, 0) 100%
      );
      box-shadow: 15px 13px 8.2px 9px rgba(0, 0, 0, 0.25);
    }
  </style>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pygwalker as pyg

  <h1>⚪ Gathering Data</h1>

  <style>
    h1 {
      color:darkblue;
      text-align: center;
      vertical-align: middle;
      border-radius: 67px;
      border: 1px solid #fff;
      background: linear-gradient(
        180deg,
        #d9d9d9 82.92%,
        rgba(217, 217, 217, 0) 100%
      );
      box-shadow: 15px 13px 8.2px 9px rgba(0, 0, 0, 0.25);
    }
  </style>

In [2]:
customers_df = pd.read_csv("./Dataset/customers.csv")
customers_df.head()

,customer_id,customer_name,gender,age,home_address,zip_code,city,state,country
0,1,fulan 1,Female,30,8606 Victoria TerraceSuite 560,5464,Johnstonhaven,Northern Territory,Australia
1,2,fulan 2,Prefer not to say,69,8327 Kirlin SummitApt. 461,8223,New Zacharyfort,South Australia,Australia
2,3,fulan 3,Prefer not to say,59,269 Gemma SummitSuite 109,5661,Aliburgh,Australian Capital Territory,Australia
3,4,fulan 4,Prefer not to say,67,743 Bailey GroveSuite 141,1729,South Justinhaven,Queensland,Australia
4,5,fulan 5,Prefer not to say,30,48 Hyatt ManorSuite 375,4032,Griffithsshire,Queensland,Australia

In [3]:
orders_df = pd.read_csv("./Dataset/orders.csv")
orders_df.head()

   order_id  customer_id  payment order_date delivery_date
0         1           64    30811  2021-8-30    2021-09-24
1         2          473    50490   2021-2-3    2021-02-13
2         3          774    46763  2021-10-8    2021-11-03
3         4          433    39782   2021-5-6    2021-05-19
4         5          441    14719  2021-3-23    2021-03-24

In [4]:
products_df = pd.read_csv("./Dataset/products.csv")
products_df.head()

,product_id,product_type,product_name,size,colour,price,quantity,description
0,0,Shirt,Oxford Cloth,XS,red,114,66,"A red coloured, XS sized, Oxford Cloth Shirt"
1,1,Shirt,Oxford Cloth,S,red,114,53,"A red coloured, S sized, Oxford Cloth Shirt"
2,2,Shirt,Oxford Cloth,M,red,114,54,"A red coloured, M sized, Oxford Cloth Shirt"
3,3,Shirt,Oxford Cloth,L,red,114,69,"A red coloured, L sized, Oxford Cloth Shirt"
4,4,Shirt,Oxford Cloth,XL,red,114,47,"A red coloured, XL sized, Oxford Cloth Shirt"

In [5]:
sales_df = pd.read_csv("./Dataset/sales.csv")
sales_df.head()

   sales_id  order_id  product_id  price_per_unit  quantity  total_price
0         0         1         218             106         2        212.0
1         1         1         481             118         1        118.0
2         2         1           2              96         3        288.0
3         3         1        1002             106         2        212.0
4         4         1         691             113         3        339.0

  <h1>⚪ Assessing Data</h1>

  <style>
    h1 {
      color:darkblue;
      text-align: center;
      vertical-align: middle;
      border-radius: 67px;
      border: 1px solid #fff;
      background: linear-gradient(
        180deg,
        #d9d9d9 82.92%,
        rgba(217, 217, 217, 0) 100%
      );
      box-shadow: 15px 13px 8.2px 9px rgba(0, 0, 0, 0.25);
    }
  </style>

# Assess the customers table

In [6]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1007 entries, 0 to 1006
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    1007 non-null   int64
 1   customer_name  1007 non-null   object
 2   gender         989 non-null    object
 3   age            1007 non-null   int64
 4   home_address   1007 non-null   object
 5   zip_code       1007 non-null   int64
 6   city           1007 non-null   object
 7   state          1007 non-null   object
 8   country        1007 non-null   object
dtypes: int64(3), object(6)
memory usage: 70.9+ KB

In [7]:
# Change the customer_id attribute to string

customers_df["customer_id"] = customers_df["customer_id"].astype(str)

# Check the data type of customer_id attribute

customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1007 entries, 0 to 1006
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    1007 non-null   object
 1   customer_name  1007 non-null   object
 2   gender         989 non-null    object
 3   age            1007 non-null   int64
 4   home_address   1007 non-null   object
 5   zip_code       1007 non-null   int64
 6   city           1007 non-null   object
 7   state          1007 non-null   object
 8   country        1007 non-null   object
dtypes: int64(2), object(7)
memory usage: 70.9+ KB

In [9]:
# Check missing value in table customers

customers_df.isna().sum()

customer_id       0
customer_name     0
gender           18
age               0
home_address      0
zip_code          0
city              0
state             0
country           0
dtype: int64

In [11]:
# Check duplicate value in table customers

print("Total duplicate value:", customers_df.duplicated().sum())

Total duplicate value: 6

In [12]:
# Check Statistics of table customers

customers_df.describe()

               age     zip_code
count  1007.000000  1007.000000
mean     50.929494  5012.538232
std      30.516299  2885.836112
min      20.000000     2.000000
25%      34.000000  2403.500000
50%      50.000000  5087.000000
75%      65.000000  7493.500000
max     700.000000  9998.000000

# Assess the order table

In [13]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1000 non-null   int64
 1   customer_id    1000 non-null   int64
 2   payment        1000 non-null   int64
 3   order_date     1000 non-null   object
 4   delivery_date  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [21]:
# Change the order_id attribute to string

orders_df["order_id"] = orders_df["order_id"].astype(str)

#  Check the data type of order_id attribute

orders_df["order_id"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: order_id
Non-Null Count  Dtype
--------------  -----
1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [22]:
# Change the delivery_date attribute to datetime

orders_df["delivery_date"] = pd.to_datetime(orders_df["delivery_date"])

# Check the data type of the delivery_date attribute

orders_df["delivery_date"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: delivery_date
Non-Null Count  Dtype
--------------  -----
1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [35]:
# Check duplicate value in table orders

print("Total duplicate value:", orders_df.duplicated().sum())

orders_df.describe()

Total duplicate value: 0

          order_id  customer_id       payment
count  1000.000000  1000.000000   1000.000000
mean    500.500000   506.640000  33972.936000
std     288.819436   277.115502  14451.609047
min       1.000000     1.000000  10043.000000
25%     250.750000   275.250000  21329.250000
50%     500.500000   515.000000  33697.500000
75%     750.250000   737.250000  46249.000000
max    1000.000000  1000.000000  59910.000000

# Assess the product table

In [36]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1266 entries, 0 to 1265
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    1266 non-null   int64
 1   product_type  1266 non-null   object
 2   product_name  1266 non-null   object
 3   size          1266 non-null   object
 4   colour        1266 non-null   object
 5   price         1266 non-null   int64
 6   quantity      1266 non-null   int64
 7   description   1266 non-null   object
dtypes: int64(3), object(5)
memory usage: 79.3+ KB

In [38]:
# Check duplicate value in table products

print("Total dupliacate value: ", products_df.duplicated().sum())

products_df.describe()

Total dupliacate value:  6

        product_id        price     quantity
count  1266.000000  1266.000000  1266.000000
mean    627.926540   105.812006    60.138231
std     363.971586     9.715611    11.682791
min       0.000000    90.000000    40.000000
25%     313.250000    95.250000    50.000000
50%     626.500000   109.000000    60.000000
75%     942.750000   114.000000    70.000000
max    1259.000000   119.000000    80.000000

# Assess the sales table

In [39]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sales_id        5000 non-null   int64
 1   order_id        5000 non-null   int64
 2   product_id      5000 non-null   int64
 3   price_per_unit  5000 non-null   int64
 4   quantity        5000 non-null   int64
 5   total_price     4981 non-null   float64
dtypes: float64(1), int64(5)
memory usage: 234.5 KB

In [40]:
# Check missing value in table sales

sales_df.isna().sum()

sales_id           0
order_id           0
product_id         0
price_per_unit     0
quantity           0
total_price       19
dtype: int64

In [42]:
# Check duplicate values in table sales

print("Total duplicate value: ", sales_df.duplicated().sum())

sales_df.describe()

Total duplicate value:  0

,sales_id,order_id,product_id,price_per_unit,quantity,total_price
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.00000,4981.000000
mean,2499.500000,503.038200,634.053200,103.501600,1.99240,206.307368
std,1443.520003,285.964418,363.255794,9.195004,0.80751,86.352449
min,0.000000,1.000000,1.000000,90.000000,1.00000,90.000000
25%,1249.750000,258.000000,323.000000,95.000000,1.00000,112.000000
50%,2499.500000,504.500000,635.000000,102.000000,2.00000,204.000000
75%,3749.250000,749.000000,951.000000,112.000000,3.00000,285.000000
max,4999.000000,999.000000,1259.000000,119.000000,3.00000,357.000000

# Summary of the assessment process

| NO  |  TABLE NAME  |                                      TIPE DATA                                      |                   MISSING VALUE                    |        DUPLICATE DATA         | INACCURATE VALUE                         |
| :-: | :----------: | :---------------------------------------------------------------------------------: | :------------------------------------------------: | :---------------------------: | ---------------------------------------- |
| 1.  | customers_df |                 There is invalid data types in column customer_id.                  |   There are 18 missing values in column gender.    | There are 6 duplicate values. | There is inaccurate value in column age. |
| 2.  |  orders_df   | There are three invalid data types in column order_id, order_date, & delivery_date. |                         -                          |               -               | -                                        |
| 3.  | products_df  |                There is one invalid data_types in column product_id.                |                         -                          | There are 6 duplicate values. | -                                        |
| 4.  |   sales_df   |   There are three invalid data types in column sales_id, order_id, & product_id.    | There are 19 missing values in column total_price. |               -               | -                                        |

  <h1>⚪ Cleaning Data</h1>

  <style>
    h1 {
      color:darkblue;
      text-align: center;
      vertical-align: middle;
      border-radius: 67px;
      border: 1px solid #fff;
      background: linear-gradient(
        180deg,
        #d9d9d9 82.92%,
        rgba(217, 217, 217, 0) 100%
      );
      box-shadow: 15px 13px 8.2px 9px rgba(0, 0, 0, 0.25);
    }
  </style>